; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-5-2-5-7-7-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 truck3 truck4 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate0)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear crate1)
	(at pallet5 distributor0)
	(clear crate2)
	(at pallet6 distributor1)
	(clear pallet6)
	(at truck0 depot0)
	(at truck1 depot1)
	(at truck2 depot2)
	(at truck3 depot0)
	(at truck4 depot4)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 distributor0)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at crate0 depot2)
	(on crate0 pallet2)
	(at crate1 depot4)
	(on crate1 pallet4)
	(at crate2 distributor0)
	(on crate2 pallet5)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet0)
		(on crate2 crate1)
	)
))

; plan
1. (lift hoist4 crate1 pallet4 depot4)
   deleted: (at crate1 depot4) (available hoist4) (on crate1 pallet4) (clear crate1)
   added: (lifting hoist4 crate1) (clear pallet4)
   goals met: 0 of 3
2. (load hoist4 crate1 truck4 depot4)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck4) (available hoist4)
   goals met: 0 of 3
3. (lift hoist5 crate2 pallet5 distributor0)
   deleted: (at crate2 distributor0) (available hoist5) (on crate2 pallet5) (clear crate2)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 0 of 3
4. (drive truck4 depot4 distributor0)
   deleted: (at truck4 depot4)
   added: (at truck4 distributor0)
   goals met: 0 of 3
5. (load hoist5 crate2 truck4 distributor0)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck4) (available hoist5)
   goals met: 0 of 3
6. (drive truck4 distributor0 depot0)
   deleted: (at truck4 distributor0)
   added: (at truck4 depot0)
   goals met: 0 of 3
7. (unload hoist0 crate1 truck4 depot0)
   deleted: (available hoist0) (in crate1 truck4)
   added: (lifting hoist0 crate1)
   goals met: 0 of 3
8. (lift hoist2 crate0 pallet2 depot2)
   deleted: (at crate0 depot2) (available hoist2) (on crate0 pallet2) (clear crate0)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 0 of 3
9. (load hoist2 crate0 truck2 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck2) (available hoist2)
   goals met: 0 of 3
10. (drive truck2 depot2 depot3)
   deleted: (at truck2 depot2)
   added: (at truck2 depot3)
   goals met: 0 of 3
11. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   goals met: 1 of 3
12. (unload hoist0 crate2 truck4 depot0)
   deleted: (available hoist0) (in crate2 truck4)
   added: (lifting hoist0 crate2)
   goals met: 1 of 3
13. (drop hoist0 crate2 crate1 depot0)
   deleted: (lifting hoist0 crate2) (clear crate1)
   added: (at crate2 depot0) (available hoist0) (on crate2 crate1) (clear crate2)
   goals met: 2 of 3
14. (unload hoist3 crate0 truck2 depot3)
   deleted: (available hoist3) (in crate0 truck2)
   added: (lifting hoist3 crate0)
   goals met: 2 of 3
15. (drop hoist3 crate0 pallet3 depot3)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (at crate0 depot3) (available hoist3) (on crate0 pallet3) (clear crate0)
   goals met: 3 of 3
